{
  "backend/main.mo": "Motoko canister managing user profiles, content packages, video assets, and leads with access control and storage mixins.",
  "feature_evidence.json": "Feature-evidence report mapping implemented features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with authenticated layout, route definitions, and theme provider.",
  "frontend/src/components/analytics/ContentLeadAttribution.tsx": "Component showing lead counts, status breakdowns, and recent submissions for a content package.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with query cache clearing and login state handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog allowing users to enter and save their name via a profile creation mutation.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with navigation links and user profile display, using router navigation and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper providing header, main content container, and footer with attribution link.",
  "frontend/src/components/video/VideoAssetManager.tsx": "Interface to add video assets via upload or URL and display existing video items with metadata.",
  "frontend/src/components/video/VideoUploadForm.tsx": "Form to upload a video file, handle progress, and save a video asset with optional metadata.",
  "frontend/src/components/video/VideoUrlForm.tsx": "Form to create a video asset from an external URL with optional metadata fields.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider offering identity loading, login, logout, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, content packages, video assets, and leads through the actor API.",
  "frontend/src/index.css": "Defines Tailwind base layers and sets light/dark theme CSS variables for UI styling.",
  "frontend/src/lib/blobStorage.ts": "Implements a simple local blob URL creator simulating video upload with optional progress callbacks.",
  "frontend/src/lib/templates/contentTemplates.ts": "Generates captions, hashtags, shot lists, and checklists for content packages based on selected vehicle and campaign parameters.",
  "frontend/src/lib/urlTracking.ts": "Parses UTM parameters from the URL and builds tracking-enabled URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ContentDetailPage.tsx": "Displays a detailed view of a content package with caption, hashtags, shots, checklists, and related leads.",
  "frontend/src/pages/ContentGeneratorPage.tsx": "Provides a UI to generate and save new content packages using customizable parameters.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing content package stats, top-performing content, and lead counts using fetched package and lead data.",
  "frontend/src/pages/LeadConfirmationPage.tsx": "Confirmation page displaying a success message after a lead submission.",
  "frontend/src/pages/LeadDetailPage.tsx": "Detailed view for a single lead with status updates, notes, and contact info management.",
  "frontend/src/pages/LeadsListPage.tsx": "Lists all leads with search and status filtering, allowing navigation to individual lead details.",
  "frontend/src/pages/PublicLandingPage.tsx": "Public form for submitting new leads tied to a content package, validating inputs and creating the lead.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended color tokens, typography/container/animation plugins, and custom animations, fonts, and container settings.",
  "project_state.json": "Stores project metadata, features, image requirements, and state versioning for a social‑media and lead‑generation app for a Ford dealership."
}